#my_list = list({1,{"asus":"Компьютер","Цена":20000,"Количество":5,"ед.":"шт."}},{2,{"hp":"Принтер","Цена":6000,"Количество":2,"ед.":"шт."}},{3,{"Genius":"Сканер","Цена":2000,"Количество":7,"ед.":"шт."}}.split(,))
dict1 = {"asus":"Компьютер","Цена":20000,"Количество":5,"ед.":"шт."}
dict2 = {"hp":"Принтер","Цена":6000,"Количество":2,"ед.":"шт."}
dict3 = {"Genius":"Сканер","Цена":2000,"Количество":7,"ед.":"шт."}
dict4 = {"Название":["Компьютер","Принтер","Сканер"], "Цена":[20000,6000,2000], "Количество":[5,2,7],"ед.":"шт."}
tuple1 = (1,dict1)
tuple2 = (2,dict2)
tuple3 = (3,dict3)
new_list = []
new_list.extend([tuple1,tuple2,tuple3])
print(new_list)
while True:
    call = int(input("Введите название товара цифрой, с которых хотите ознакомится (Компьютер(1), Принтер(2), Сканер(3)). Если хотите вывести аналитику нажмине (4): "))
    if call == 1:
        print(new_list[0])
    if call == 2:
        print(new_list[1])
    if call == 3:
        print(new_list[2])
    if call == 4:
        for i in dict4:
            print(str(i) + str(dict4.get(i)))